import {FC} from 'react';

import styles from './terms-page.module.scss'

type TermsPageType = {
    contentView: string
}

export const TermsPage: FC<TermsPageType> = ({contentView}) => (
    <div className={styles.commonContainer}>
        <ol className={styles.mainList}>
            <h3>{contentView}</h3>
            <li>1. Идейные соображения высшего порядка, а также высокое качество позиционных
                исследований представляет собой интересный эксперимент проверки экспериментов,
                поражающих по своей масштабности и грандиозности.
                <ol className={styles.list1}>
                    <li>1.1. Задача организации, в особенности же социально-экономическое развитие
                        однозначно определяет каждого участника как способного принимать собственные
                        решения касаемо инновационных методов управления процессами.
                    </li>
                    <li>1.2. Не следует, однако, забывать, что разбавленное изрядной долей эмпатии,
                        рациональное мышление играет важную роль в формировании приоритизации разума
                        над
                        эмоциями. Но некоторые особенности внутренней политики лишь добавляют
                        фракционных разногласий и преданы социально-демократической анафеме.
                    </li>
                    <li>1.3. Приятно, граждане, наблюдать, как элементы политического процесса,
                        превозмогая сложившуюся непростую экономическую ситуацию, объявлены
                        нарушающими
                        общечеловеческие нормы этики и морали.
                    </li>
                    <li>1.4. Но независимые государства, которые представляют собой яркий пример
                        континентально-европейского типа политической культуры, будут объединены в
                        целые
                        кластеры себе подобных.
                    </li>
                </ol>
            </li>

            <li>2. С учётом сложившейся международной обстановки, консультация с широким активом
                предоставляет широкие возможности для приоритизации разума над эмоциями.
                <ol className={styles.list2}>
                    <li>2.1. Задача организации, в особенности же социально-экономическое развитие
                        однозначно определяет каждого участника как способного принимать собственные
                        решения касаемо инновационных методов управления процессами.
                        <ol className={styles.list2_1}>
                            <li>2.1.1. Не следует, однако, забывать, что разбавленное изрядной долей
                                эмпатии, рациональное мышление играет важную роль в формировании
                                приоритизации разума над эмоциями. Но некоторые особенности
                                внутренней
                                политики лишь добавляют фракционных разногласий и преданы
                                социально-демократической анафеме.
                            </li>
                            <li>2.1.2. Приятно, граждане, наблюдать, как элементы политического
                                процесса,
                                превозмогая сложившуюся непростую экономическую ситуацию, объявлены
                                нарушающими общечеловеческие нормы этики и морали.
                            </li>
                        </ol>
                    </li>

                    <li>2.2. Но независимые государства, которые представляют собой яркий пример
                        континентально-европейского типа политической культуры, будут объединены в
                        целые
                        кластеры себе подобных.
                    </li>
                </ol>
            </li>

            <li>3. Принимая во внимание показатели успешности, укрепление и развитие внутренней
                структуры требует от нас анализа приоритизации разума над эмоциями.
                <ol className={styles.list3}>
                    <li>3.1. Задача организации, в особенности же социально-экономическое развитие
                        однозначно определяет каждого участника как способного принимать собственные
                        решения касаемо инновационных методов управления процессами.
                        <ol className={styles.list3_1}>
                            <li>3.1.1. Не следует, однако, забывать, что разбавленное изрядной долей
                                эмпатии, рациональное мышление играет важную роль в формировании
                                приоритизации разума над эмоциями. Но некоторые особенности
                                внутренней
                                политики лишь добавляют фракционных разногласий и преданы
                                социально-демократической анафеме.
                            </li>
                            <li>3.1.2. Приятно, граждане, наблюдать, как элементы политического
                                процесса,
                                превозмогая сложившуюся непростую экономическую ситуацию, объявлены
                                нарушающими общечеловеческие нормы этики и морали.
                            </li>
                        </ol>
                    </li>

                    <li>3.2. Но независимые государства, которые представляют собой яркий пример
                        континентально-европейского типа политической культуры, будут объединены в
                        целые
                        кластеры себе подобных.
                    </li>
                    <li>3.3. Не следует, однако, забывать, что экономическая повестка сегодняшнего
                        дня
                        требует анализа анализа существующих паттернов поведения.
                        <ol className={styles.list3_3}>
                            <li>3.3.1. А ещё представители современных социальных резервов набирают
                                популярность среди определенных слоев населения, а значит, должны
                                быть
                                функционально разнесены на независимые элементы.
                                <ol className={styles.list3_3_1}>
                                    <li>3.3.1.1. Стремящиеся вытеснить традиционное производство,
                                        нанотехнологии
                                        могут быть объявлены нарушающими общечеловеческие нормы
                                        этики и морали.
                                    </li>
                                    <li>3.3.1.2. Прежде всего, разбавленное изрядной долей эмпатии,
                                        рациональное
                                        мышление однозначно фиксирует необходимость новых
                                        предложений. Являясь
                                        всего лишь частью общей картины, независимые государства
                                        представлены в
                                        исключительно положительном свете.
                                    </li>
                                </ol>
                            </li>
                        </ol>
                    </li>

                    <li>3.4. Повседневная практика показывает, что убеждённость некоторых оппонентов
                        требует от нас анализа распределения внутренних резервов и ресурсов.
                    </li>
                </ol>
            </li>

        </ol>
    </div>
);

